In [ ]:
# install psycopg2 and sqlalchemy if not already

In [1]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [2]:
order_df = pd.read_csv(r"C:\Users\...\datasets\orders.csv")
aisles_df = pd.read_csv(r"C:\Users\...\datasets\aisles.csv")
departments_df = pd.read_csv(r"C:\Users\...\datasets\departments.csv")
order_products_df = pd.read_csv(r"C:\Users\...\datasets\order_products.csv").sample(10000)
products_df = pd.read_csv(r"C:\Users\...\datasets\products.csv")

In [3]:
order_df.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [4]:
aisles_df.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [5]:
departments_df.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [6]:
order_products_df.head()

          order_id  product_id  add_to_cart_order  reordered
25385772   2677378       47626                  3          1
1414914     149197       32033                  3          0
6600953     696768        8193                  4          0
16209518   1710206       14971                 10          1
4021405     424343       25146                  3          1

In [7]:
products_df.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [8]:
#connection
try:
    conn = psycopg2.connect(dbname="ecommerce-data-model-and-analysis", user='postgres', password='root', port='5432')
except:
    print("connection was unsuccessful")

In [9]:
cur = conn.cursor() # cursor is used execute query on SQL engine

In [10]:
# for bulk insert of data
engine = create_engine('postgresql+psycopg2://postgres:root@localhost/ecommerce-data-model-and-analysis')

In [11]:
cur.execute("""
CREATE TABLE aisles (
    aisle_id INTEGER PRIMARY KEY,
    aisle VARCHAR
)
""")

In [12]:
cur.execute("""
CREATE TABLE departments (
    department_id INTEGER PRIMARY KEY,
    department VARCHAR(255)
)
""")

In [13]:
cur.execute("""
CREATE TABLE products (
    product_id INTEGER PRIMARY KEY,
    product_name VARCHAR(255),
    aisle_id INTEGER,
    department_id INTEGER,
    FOREIGN KEY (aisle_id) REFERENCES aisles (aisle_id),
    FOREIGN KEY (department_id) REFERENCES departments (department_id)
)
""")

In [14]:
cur.execute("""
CREATE TABLE orders (
    order_id INTEGER PRIMARY KEY,
    user_id INTEGER,
    order_number INTEGER,
    order_dow INTEGER,
    order_hour_of_day INTEGER,
    days_since_prior_order INTEGER )
""")

In [15]:
cur.execute("""
CREATE TABLE order_products (
    order_id INTEGER,
    product_id INTEGER,
    add_to_cart_order INTEGER,
    reordered INTEGER,
    PRIMARY KEY (order_id, product_id),
    FOREIGN KEY (order_id) REFERENCES orders (order_id),
    FOREIGN KEY (product_id) REFERENCES products (product_id)
    )
""")

In [16]:
conn.commit()

In [17]:
order_df.drop('eval_set', inplace=True, axis=1)

In [18]:
aisles_df.to_sql('aisles', con=engine, if_exists='append', index=False)

134

In [19]:
departments_df.to_sql('departments', con=engine, if_exists='append', index=False)

21

In [20]:
products_df.to_sql('products', con=engine, if_exists='append', index=False)

688

In [21]:
order_df.to_sql('orders', con=engine, if_exists='append', index=False)

83

In [22]:
order_products_df.to_sql('order_products', con=engine, if_exists='append', index=False)

1000